"""
Написать функцию host_range_ping_tab(), возможности которой основаны на функции из примера 2.
Но в данном случае результат должен быть итоговым по всем ip-адресам, представленным в табличном формате
(использовать модуль tabulate). Таблица должна состоять из двух колонок
"""

from tabulate import tabulate
from task_2 import host_range_ping


def host_range_ping_tab():
    # запрашиваем хосты, проверяем доступность, получаем словарь результатов
    res_dict = host_range_ping()
    print()
    # выводим в табличном виде
    print(tabulate([res_dict], headers='keys', tablefmt="pipe", stralign="center"))


if __name__ == "__main__":
    host_range_ping_tab()

'''
Результат:

Введите первоначальный адрес: 173.245.49.22
Сколько адресов проверить?: 10
173.245.49.22 - Узел доступен
173.245.49.23 - Узел доступен
173.245.49.24 - Узел доступен
173.245.49.25 - Узел доступен
173.245.49.26 - Узел доступен
173.245.49.27 - Узел доступен
173.245.49.28 - Узел доступен
173.245.49.29 - Узел доступен
173.245.49.30 - Узел доступен
173.245.49.31 - Узел недоступен

|  Доступные узлы  |  Недоступные узлы  |
|:----------------:|:------------------:|
|  173.245.49.22   |   173.245.49.31    |
|  173.245.49.23   |                    |
|  173.245.49.24   |                    |
|  173.245.49.25   |                    |
|  173.245.49.26   |                    |
|  173.245.49.27   |                    |
|  173.245.49.28   |                    |
|  173.245.49.29   |                    |
|  173.245.49.30   |                    |

'''
